:PROPERTIES:
:ID: E3A8668F-26E7-44F3-BD47-6255FC87AEC0
:END:
#+title: List All Current Accounts
#+description: List All Current Accounts
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:sql:accounts:
#+created: 2026-05-21
#+updated: 2026-05-21

Get all currently active accounts (where =valid_to= is infinity):

#+begin_src sql
select id, username, email, version, valid_from
from ores.accounts
where valid_to = '9999-12-31 23:59:59'::timestamptz
order by username;
#+end_src

#+RESULTS:
#+begin_example
id	username	email	version	valid_from
#+end_example
